## 데이터 조작

In [2]:
import numpy as np 
import pandas as pd

### 데이터 갯수 세기

In [4]:
s = pd.Series(range(10))
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [5]:
s.count()

9

In [6]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype=float)
df.iloc[2, 3] = np.nan
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [7]:
df.count()

0    4
1    4
2    4
3    3
dtype: int64

In [8]:
df.count(axis=1)

0    4
1    4
2    3
3    4
dtype: int64

In [9]:
import seaborn as sns 
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [10]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [11]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

### 카테고리 값 세기

In [13]:
vec = np.random.randint(6, size=100)
s2 = pd.Series(vec)
s2.tail()

95    3
96    0
97    0
98    2
99    5
dtype: int32

In [14]:
s2.value_counts()

2    22
0    18
3    17
1    15
5    15
4    13
dtype: int64

In [15]:
titanic['class'].value_counts()

Third     491
First     216
Second    184
Name: class, dtype: int64

In [16]:
titanic['sibsp'].value_counts()

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: sibsp, dtype: int64

### 정렬

In [17]:
s2.value_counts().sort_index()

0    18
1    15
2    22
3    17
4    13
5    15
dtype: int64

In [18]:
s2.sort_values()

42    0
96    0
20    0
37    0
39    0
     ..
25    5
22    5
7     5
83    5
99    5
Length: 100, dtype: int32

In [20]:
s2.sort_values(ascending=False)

99    5
83    5
49    5
57    5
59    5
     ..
13    0
80    0
73    0
74    0
81    0
Length: 100, dtype: int32

In [22]:
df = pd.DataFrame(np.random.rand(16).reshape(4,4))
df

          0         1         2         3
0  0.662202  0.387523  0.497074  0.414906
1  0.350872  0.550978  0.972911  0.112776
2  0.313259  0.041798  0.738400  0.657512
3  0.214636  0.416753  0.643842  0.661481

In [23]:
df.sort_values(by=1)

          0         1         2         3
2  0.313259  0.041798  0.738400  0.657512
0  0.662202  0.387523  0.497074  0.414906
3  0.214636  0.416753  0.643842  0.661481
1  0.350872  0.550978  0.972911  0.112776

In [24]:
df

          0         1         2         3
0  0.662202  0.387523  0.497074  0.414906
1  0.350872  0.550978  0.972911  0.112776
2  0.313259  0.041798  0.738400  0.657512
3  0.214636  0.416753  0.643842  0.661481

### 행/열 합계

In [26]:
np.random.seed(1)
df2 = pd.DataFrame(np.random.randint(10, size=(4, 8)))
df2

   0  1  2  3  4  5  6  7
0  5  8  9  5  0  0  1  7
1  6  9  2  4  5  2  4  2
2  4  7  7  9  1  7  0  6
3  9  9  7  6  9  1  0  1

In [28]:
df2.sum()  #axis=0 이 디폴트

0    24
1    33
2    25
3    24
4    15
5    10
6     5
7    16
dtype: int64

In [30]:
df2.sum(axis=1)

0    35
1    34
2    41
3    42
dtype: int64

In [32]:
df2['행의 합'] = df2.sum(axis=1)
df2

   0  1  2  3  4  5  6  7  행의 합
0  5  8  9  5  0  0  1  7    70
1  6  9  2  4  5  2  4  2    68
2  4  7  7  9  1  7  0  6    82
3  9  9  7  6  9  1  0  1    84

In [36]:
df2.loc['열의 합',:] = df2.sum()
df2

         0     1     2     3     4     5    6     7   행의 합   열의 합
0      5.0   8.0   9.0   5.0   0.0   0.0  1.0   7.0   70.0   24.0
1      6.0   9.0   2.0   4.0   5.0   2.0  4.0   2.0   68.0   33.0
2      4.0   7.0   7.0   9.0   1.0   7.0  0.0   6.0   82.0   25.0
3      9.0   9.0   7.0   6.0   9.0   1.0  0.0   1.0   84.0   24.0
열의 합  24.0  33.0  25.0  24.0  15.0  10.0  5.0  16.0  304.0  106.0

In [39]:
titanic['age'].value_counts()

24.00    30
22.00    27
18.00    26
28.00    25
19.00    25
         ..
55.50     1
74.00     1
0.92      1
70.50     1
12.00     1
Name: age, Length: 88, dtype: int64

In [40]:
titanic['age'].mean()

29.69911764705882

In [46]:
t2 = titanic[titanic['sex'] == 'female']
round(t2['age'].mean(), 2)

27.92

In [49]:
t3 = titanic[(titanic['class'] == 'First') & (titanic['sex'] == 'female')]
round(t3['age'].mean(),2)

34.61

### apply 변환

In [52]:
x, y = map(int, input('정수 2개 입력 > ').split())

In [53]:
x, y

(10, 20)

In [54]:
df3 = pd.DataFrame({
    'A': [1, 3, 4, 3, 4],
    'B': [2, 3, 1, 2, 3],
    'C': [1, 5, 2, 4, 4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [57]:
def diff(x):            # x는 series 
    return x.max() - x.min()

In [58]:
df3.apply(diff)

A    3
B    2
C    4
dtype: int64

In [59]:
df3.apply(lambda x : x.max()- x.min())

A    3
B    2
C    4
dtype: int64

In [60]:
df3.apply(lambda x : x.max()- x.min(), axis=1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [62]:
titanic['adult/child'] = titanic.apply(lambda r: 'adult' if r.age >= 20 else 'child', axis=1)
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,adult
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adult
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adult

### fillna() method

In [64]:
df3.apply(pd.value_counts)

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [66]:
df3.apply(pd.value_counts).fillna(0.0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

###astype() method

In [70]:
df3.apply(pd.value_counts).fillna(0.0).astype(int)

   A  B  C
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1

In [69]:
df3.apply(pd.value_counts).fillna(0.0).astype(float)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [72]:
titanic['age'] = titanic['age'].fillna(0)
titanic['category2'] = titanic['sex'] + titanic ['age'].astype(int).astype(str)
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category2
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,adult,male22
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult,female38
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult,female26
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adult,female35
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adult,male35

In [73]:
sns.load_dataset('iris')

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]